ZXCLI/Multiphase-Interleaved-CLLC/CLLC.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28004x" --package "F28004x_100PZ" --part "F28004x_100PZ" --context "system" --product "C2000WARE@5.01.00.00"
 * @versions {"tool":"1.19.0+3426"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const asysctl          = scripting.addModule("/driverlib/asysctl.js");
const cmpss            = scripting.addModule("/driverlib/cmpss.js", {}, false);
const cmpss1           = cmpss.addInstance();
const cmpss2           = cmpss.addInstance();
const cmpss3           = cmpss.addInstance();
const cmpss4           = cmpss.addInstance();
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const cputimer2        = cputimer.addInstance();
const cputimer3        = cputimer.addInstance();
const dac              = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1             = dac.addInstance();
const dac2             = dac.addInstance();
const ecap             = scripting.addModule("/driverlib/ecap.js", {}, false);
const ecap1            = ecap.addInstance();
const ecap2            = ecap.addInstance();
const ecap3            = ecap.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const epwm4            = epwm.addInstance();
const epwm5            = epwm.addInstance();
const epwm6            = epwm.addInstance();
const epwm7            = epwm.addInstance();
const epwm8            = epwm.addInstance();
const epwmxbar         = scripting.addModule("/driverlib/epwmxbar.js", {}, false);
const epwmxbar1        = epwmxbar.addInstance();
const epwmxbar2        = epwmxbar.addInstance();
const epwmxbar3        = epwmxbar.addInstance();
const epwmxbar4        = epwmxbar.addInstance();
const epwmxbar5        = epwmxbar.addInstance();
const epwmxbar6        = epwmxbar.addInstance();
const epwmxbar7        = epwmxbar.addInstance();
const epwmxbar8        = epwmxbar.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const gpio4            = gpio.addInstance();
const gpio5            = gpio.addInstance();
const gpio6            = gpio.addInstance();
const gpio7            = gpio.addInstance();
const gpio8            = gpio.addInstance();
const gpio9            = gpio.addInstance();
const gpio10           = gpio.addInstance();
const gpio11           = gpio.addInstance();
const gpio12           = gpio.addInstance();
const gpio13           = gpio.addInstance();
const gpio14           = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const inputxbar_input2 = inputxbar_input.addInstance();
const inputxbar_input3 = inputxbar_input.addInstance();
const inputxbar_input4 = inputxbar_input.addInstance();
const inputxbar_input5 = inputxbar_input.addInstance();
const outputxbar       = scripting.addModule("/driverlib/outputxbar.js", {}, false);
const outputxbar1      = outputxbar.addInstance();
const outputxbar2      = outputxbar.addInstance();
const pmbus            = scripting.addModule("/driverlib/pmbus.js", {}, false);
const pmbus1           = pmbus.addInstance();
const sci              = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1             = sci.addInstance();
const sync             = scripting.addModule("/driverlib/sync.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.soc3Channel       = "ADC_CH_ADCIN3";
adc1.soc3SampleWindow  = 10;
adc1.enabledSOCs       = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc1.soc0Channel       = "ADC_CH_ADCIN2";
adc1.soc1Channel       = "ADC_CH_ADCIN3";
adc1.soc2Channel       = "ADC_CH_ADCIN4";
adc1.$name             = "M_ADC_A";
adc1.adcClockPrescaler = "ADC_CLK_DIV_2_0";
adc1.soc2Trigger       = "ADC_TRIGGER_EPWM3_SOCA";
adc1.soc1Trigger       = "ADC_TRIGGER_EPWM3_SOCA";
adc1.soc0SampleWindow  = 30;
adc1.soc1SampleWindow  = 30;
adc1.soc2SampleWindow  = 30;

adc2.adcBase           = "ADCB_BASE";
adc2.adcClockPrescaler = "ADC_CLK_DIV_2_0";
adc2.soc4Channel       = "ADC_CH_ADCIN4";
adc2.soc4SampleWindow  = 10;
adc2.soc5Channel       = "ADC_CH_ADCIN6";
adc2.soc5SampleWindow  = 10;
adc2.soc1Channel       = "ADC_CH_ADCIN1";
adc2.soc2Channel       = "ADC_CH_ADCIN2";
adc2.$name             = "M_ADC_B";
adc2.enabledSOCs       = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc2.soc3Channel       = "ADC_CH_ADCIN3";
adc2.soc0Trigger       = "ADC_TRIGGER_EPWM3_SOCA";
adc2.soc3Trigger       = "ADC_TRIGGER_EPWM3_SOCA";
adc2.soc0SampleWindow  = 30;
adc2.soc1SampleWindow  = 30;
adc2.soc2SampleWindow  = 30;
adc2.soc3SampleWindow  = 30;

adc3.adcClockPrescaler = "ADC_CLK_DIV_2_0";
adc3.adcBase           = "ADCC_BASE";
adc3.soc7SampleWindow  = 10;
adc3.soc6SampleWindow  = 10;
adc3.soc6Channel       = "ADC_CH_ADCIN8";
adc3.soc7Channel       = "ADC_CH_ADCIN10";
adc3.soc1Channel       = "ADC_CH_ADCIN1";
adc3.enabledSOCs       = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc3.soc2Channel       = "ADC_CH_ADCIN2";
adc3.$name             = "M_ADC_C";
adc3.soc0Trigger       = "ADC_TRIGGER_EPWM3_SOCA";
adc3.soc2Trigger       = "ADC_TRIGGER_EPWM3_SOCA";
adc3.soc0SampleWindow  = 30;
adc3.soc1SampleWindow  = 30;
adc3.soc2SampleWindow  = 30;

asysctl.analogReference        = "INTERNAL";
asysctl.analogReferenceVoltage = "1P65";

const multiplier2         = system.clockTree["PLL_IMULT"];
multiplier2.multiplyValue = 10;

const mux1       = system.clockTree["CANABCLKSEL"];
mux1.inputSelect = "XTAL";

const mux2       = system.clockTree["OSCCLKSRCSEL"];
mux2.inputSelect = "X1_XTAL";

cmpss1.$name            = "M_CMPSS1";
cmpss1.configBlanking   = "3";
cmpss1.enableModule     = true;
cmpss1.lowCompInvert    = true;
cmpss1.sampleWindowHigh = 10;
cmpss1.thresholdHigh    = 8;
cmpss1.dacValLow        = 1000;
cmpss1.dacValHigh       = 2800;

cmpss2.cmpssBase           = "CMPSS2_BASE";
cmpss2.asysCMPHPMXSELValue = "1";
cmpss2.$name               = "M_CMPSS2";

cmpss3.cmpssBase = "CMPSS3_BASE";
cmpss3.$name     = "M_CMPSS3";

