ZXCLI/Multiphase-Interleaved-CLLC/CLLC.syscfg
epwm6.$name                                                   = "M_EPWM6";
epwm6.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm6.epwmCounterCompare_cmpA                                 = 250;
epwm6.epwmCounterCompare_cmpB                                 = 250;
epwm6.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm6.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm6.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm6.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm6.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm6.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm6.hrpwm_DBredHR                                           = 2;
epwm6.hrpwm_DBfedHR                                           = 2;
epwm6.epwmDeadband_enableRED                                  = true;
epwm6.epwmDeadband_redShadowMode                              = true;
epwm6.epwmDeadband_delayRED                                   = 20;
epwm6.epwmDeadband_enableFED                                  = true;
epwm6.epwmDeadband_fedShadowMode                              = true;
epwm6.epwmDeadband_delayFED                                   = 20;
epwm6.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm6.copyUse                                                 = true;
epwm6.epwmTimebase_period                                     = 500;
epwm6.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm6.copyFrom                                                = "M_EPWM2";
epwm6.epwm.$assign                                            = "EPWM6";
epwm6.epwm.epwm_aPin.$assign                                  = "GPIO10";
epwm6.epwm.epwm_bPin.$assign                                  = "GPIO11";

epwm7.$name                                                   = "M_EPWM7";
epwm7.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm7.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm7.epwmCounterCompare_cmpA                                 = 250;
epwm7.epwmCounterCompare_cmpB                                 = 250;
epwm7.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm7.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm7.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm7.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm7.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm7.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm7.hrpwm_DBredHR                                           = 2;
epwm7.hrpwm_DBfedHR                                           = 2;
epwm7.epwmDeadband_enableRED                                  = true;
epwm7.epwmDeadband_redShadowMode                              = true;
epwm7.epwmDeadband_delayRED                                   = 20;
epwm7.epwmDeadband_enableFED                                  = true;
epwm7.epwmDeadband_fedShadowMode                              = true;
epwm7.epwmDeadband_delayFED                                   = 20;
epwm7.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm7.copyUse                                                 = true;
epwm7.epwmTimebase_period                                     = 500;
epwm7.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm7.copyFrom                                                = "M_EPWM2";
epwm7.epwm.$assign                                            = "EPWM7";
epwm7.epwm.epwm_aPin.$assign                                  = "GPIO12";
epwm7.epwm.epwm_bPin.$assign                                  = "GPIO13";

epwm8.$name                                                   = "M_EPWM8";
epwm8.epwmTimebase_hsClockDiv                                 = "EPWM_HSCLOCK_DIVIDER_1";
epwm8.epwmDeadband_polarityFED                                = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm8.hrpwm_HRLoadA                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm8.hrpwm_HRLoadB                                           = "HRPWM_LOAD_ON_CNTR_ZERO_PERIOD";
epwm8.hrpwm_edgeModeA                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm8.epwmCounterCompare_cmpA                                 = 250;
epwm8.epwmCounterCompare_cmpB                                 = 250;
epwm8.hrpwm_edgeModeDB                                        = "HRPWM_DB_MEP_CTRL_RED_FED";
epwm8.hrpwm_edgeModeB                                         = "HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE";
epwm8.epwmTimebase_counterMode                                = "EPWM_COUNTER_MODE_UP";
epwm8.hrpwm_DBredHR                                           = 2;
epwm8.hrpwm_DBfedHR                                           = 2;
epwm8.epwmDeadband_enableRED                                  = true;
epwm8.epwmDeadband_redShadowMode                              = true;
epwm8.epwmDeadband_delayRED                                   = 20;
epwm8.epwmDeadband_enableFED                                  = true;
epwm8.epwmDeadband_fedShadowMode                              = true;
epwm8.epwmDeadband_delayFED                                   = 20;
epwm8.epwmDeadband_deadbandCounterClockRate                   = "EPWM_DB_COUNTER_CLOCK_HALF_CYCLE";
epwm8.copyUse                                                 = true;
epwm8.epwmTimebase_period                                     = 500;
epwm8.epwmTimebase_syncOutPulseMode                           = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD = "EPWM_AQ_OUTPUT_TOGGLE";
epwm8.copyFrom                                                = "M_EPWM2";
epwm8.epwm.$assign                                            = "EPWM8";
epwm8.epwm.epwm_aPin.$assign                                  = "GPIO14";
epwm8.epwm.epwm_bPin.$assign                                  = "GPIO15";

epwmxbar1.tripInput       = "XBAR_TRIP5";
epwmxbar1.$name           = "CMPSS2OUT";
epwmxbar1.useSourceSelect = true;
epwmxbar1.sourceSignals   = ["CMPSS2_CTRIPH_OR_L"];

epwmxbar2.tripInput       = "XBAR_TRIP7";
epwmxbar2.$name           = "CMPSS3OUT";
epwmxbar2.useSourceSelect = true;
epwmxbar2.sourceSignals   = ["CMPSS3_CTRIPH_OR_L"];

