ZXCLI/Multiphase-Interleaved-CLLC/CLLC.syscfg
epwmxbar3.tripInput       = "XBAR_TRIP8";
epwmxbar3.$name           = "CMPSS7OUT";
epwmxbar3.useSourceSelect = true;
epwmxbar3.sourceSignals   = ["CMPSS7_CTRIPH_OR_L"];

epwmxbar4.$name           = "CLB1H";
epwmxbar4.tripInput       = "XBAR_TRIP9";
epwmxbar4.useSourceSelect = true;
epwmxbar4.sourceSignals   = ["CLB1_OUT4"];

epwmxbar5.tripInput       = "XBAR_TRIP10";
epwmxbar5.$name           = "CLB1L";
epwmxbar5.useSourceSelect = true;
epwmxbar5.sourceSignals   = ["CLB1_OUT5"];

epwmxbar6.tripInput       = "XBAR_TRIP11";
epwmxbar6.$name           = "CLB2H";
epwmxbar6.useSourceSelect = true;
epwmxbar6.sourceSignals   = ["CLB2_OUT4"];

epwmxbar7.tripInput       = "XBAR_TRIP12";
epwmxbar7.$name           = "CLB2L";
epwmxbar7.useSourceSelect = true;
epwmxbar7.sourceSignals   = ["CLB2_OUT5"];

epwmxbar8.$name           = "CMPSS1OUT";
epwmxbar8.useSourceSelect = true;
epwmxbar8.sourceSignals   = ["CMPSS1_CTRIPH_OR_L"];

gpio1.$name     = "FAULT_INPUT1";
gpio1.padConfig = "PULLUP";

gpio2.$name           = "FAULT_INPUT2";
gpio2.gpioPin.$assign = "GPIO29";

gpio3.$name           = "FAULT_OUTPUT";
gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign = "GPIO31";

gpio4.$name           = "DEBUG1";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign = "GPIO30";

gpio5.$name           = "ACTIVE1";
gpio5.gpioPin.$assign = "GPIO34";

gpio6.$name           = "ACTIVE2";
gpio6.gpioPin.$assign = "GPIO59";

gpio7.$name             = "STATUS1";
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.writeInitialValue = true;
gpio7.initialValue      = 1;
gpio7.gpioPin.$assign   = "GPIO39";

gpio8.$name             = "STATUS2";
gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.writeInitialValue = true;
gpio8.initialValue      = 1;
gpio8.gpioPin.$assign   = "GPIO40";

gpio9.$name                      = "PRIM_ZCD1";
gpio9.padConfig                  = "PULLUP";
gpio9.useInterrupt               = true;
gpio9.gpioPin.$assign            = "GPIO23_VSW";
gpio9.xint.intType               = "GPIO_INT_TYPE_BOTH_EDGES";
gpio9.xint.registerInterrupts    = true;
gpio9.xint.enableInt             = true;
gpio9.xint.xInt.interruptHandler = "ISR1_PZCD";

gpio10.$name           = "PRIM_ZCD2";
gpio10.gpioPin.$assign = "GPIO22_VFBSW";

gpio11.$name           = "DEBUG2";
gpio11.direction       = "GPIO_DIR_MODE_OUT";
gpio11.gpioPin.$assign = "GPIO58";

gpio12.$name           = "FAN2";
gpio12.direction       = "GPIO_DIR_MODE_OUT";
gpio12.gpioPin.$assign = "GPIO35/TDI";

gpio13.$name           = "SEC_ZCD1";
gpio13.gpioPin.$assign = "GPIO33";

gpio14.$name           = "SEC_ZCD2";
gpio14.gpioPin.$assign = "GPIO17";

gpio9.xint.inputxbar           = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO23";
inputxbar_input1.$name         = "PZCD1";

inputxbar_input2.$name         = "TZ1";
inputxbar_input2.inputxbarGpio = "GPIO28";

inputxbar_input3.$name          = "TZ2";
inputxbar_input3.inputxbarInput = "XBAR_INPUT2";
inputxbar_input3.inputxbarGpio  = "GPIO29";

inputxbar_input4.inputxbarInput = "XBAR_INPUT6";
inputxbar_input4.inputxbarGpio  = "GPIO4";
inputxbar_input4.$name          = "EPWM3_CAP";

inputxbar_input5.$name          = "EPWM1_CAP";
inputxbar_input5.inputxbarInput = "XBAR_INPUT7";
inputxbar_input5.inputxbarGpio  = "GPIO0";

outputxbar1.$name                            = "FAN1";
outputxbar1.sourceSignals                    = ["ECAP1_OUT"];
outputxbar1.useSourceSelect                  = true;
outputxbar1.outputxbar.$assign               = "OUTPUTXBAR1";
outputxbar1.outputxbar.outputxbarPin.$assign = "GPIO24";

outputxbar2.$name                            = "CMPSS1OUT0";
outputxbar2.useSourceSelect                  = true;
outputxbar2.sourceSignals                    = ["CMPSS1_CTRIPOUTH_OR_L"];
outputxbar2.outputxbar.$assign               = "OUTPUTXBAR2";
outputxbar2.outputxbar.outputxbarPin.$assign = "GPIO37/TDO";

pmbus1.$name                                    = "myPMBUS0";
pmbus1.pmbus.pmbus_alertPin.$assign             = "GPIO27";
pmbus1.pmbus.pmbus_ctlPin.$assign               = "GPIO26";
pmbus1.pmbus.pmbus_sclPin.$assign               = "GPIO16";
pmbus1.pmbus.pmbus_sdaPin.$assignAllowConflicts = "GPIO25";

sci1.$name                 = "DEBUG";
sci1.useInterrupts         = false;
sci1.sci.$assign           = "SCIB";
sci1.sci.sci_rxPin.$assign = "GPIO57";
sci1.sci.sci_txPin.$assign = "GPIO56";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.epwm_aPin.$suggestSolution = "GPIO0";
epwm1.epwm.epwm_bPin.$suggestSolution = "GPIO1";
gpio1.gpioPin.$suggestSolution        = "GPIO28";
pmbus1.pmbus.$suggestSolution         = "PMBUSA";
